import torch

# 1. 设置随机种子
torch.manual_seed(24)

# 2. 创建随机张量
t1 = torch.randint(1,10,(5,5))
print(f't1:{t1}')
print('-' * 30)

# 3.演示张量的索引操作.
# 场景1:简单行列索引
# 需求1: 获取第二行的数据
print(t1[1])
print(t1[1,:])   # 效果同上 

# 需求2:所有行的第三列数据
print(t1[:,2])
print('-' * 30)

# 场景2: 列表索引 
# 需求1:返回(0,1),(1,2)两个位置的元素
print(t1[[0,1],[1,2]])

# 需求2:返回(1,2),(3,4)两个位置的元素
print(t1[[1,3],[2,4]])

# 需求3: 获取第0,1行的1,2列共4个元素
print(t1[[[0],[1]],[1,2]])
print('-' * 30)

# 场景3: 范围索引
# 需求1: 前3行，前2列.
print(t1[:3,:2])

# 需求2：第二行到最后一行,前两列的数据
print(t1[1:,:2])

# 需求3: 所有奇数行,偶数列
print(t1[1::2,0::2])

# 场景4: 布尔索引
# 需求1:第3列 大于5的行数据 
print(t1[t1[:,2] > 5])

# 需求2: 第2行大于5的 列数据 
# 理解1: 在第2行的基础上，找到该行中大于5的列索引，然后找到所有行中对应的列元素 
print(t1[:,t1[1,:]>5])

# 理解2: 在第2行的基础上,找到该行中所有大于5的元素 
print(t1[1,t1[1,:]>5])
print('-' * 30)

# 场景5: 多维索引
# 创建3维张量, 即 2个3行4列的矩阵
t2 = torch.randint(1,10,(2,3,4)) 
print(f't2:{t2}')

# 需求1: 获取0轴上的第一个数据
print(t2[0,:,:])

# 需求2:获取1轴上的第一个数据
print(t2[:,0,:])

# 需求3: 获取2轴上的第一个数据
print(t2[:,:,0])

