"""
循环网络层的作用: 基于 上一次的隐藏状态 + 本次的输入 -> 本次的隐藏状态 本次的输入
    公式: 本次的隐藏状态 = tanh(上次的隐藏状态加权求和 + 本次的输入加权求和)
         本次的输出 = 本次的隐藏状态加权求和
    词嵌入层: 将词的索引转换为 词向量表示
    循环网络层: 逐步处理词向量 生成 每个时间步的 隐藏状态
    全连接层: 通过线性变换将隐藏状态映射到输出 通常是1个词汇表中词的概率分布   
"""

# 导包 
import torch
import torch.nn as nn

# 1.创建循环网络层
# 参数1: 词向量的维度的 
# 参数2: 隐藏状态向量维度
# 参数3: 隐藏层数量
rnn = nn.RNN(input_size=128,hidden_size=256,num_layers=1)

# 2.定义变量 表示输入的x
# 参数1: 每个句子的词的个数
# 参数2: 句子的数量
# 参数3: 词向量的维度
x = torch.randn(size=(5,32,128))

# 3.定义变量 记录上一时刻的隐藏状态
# 参数1:隐藏层的层数
# 参数2: 句子的数量
# 参数3:隐藏状态向量的维度
h0 = torch.randn(size=(1,32,256))

# 4.调用RNN处理
output,h1 = rnn(x,h0)
print(f'output:{output.shape}')
print(f'h1:{h1.shape}')